In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

## Series
A Series is a one-dimensional array-like object containing a sequence of values (of
similar types to NumPy types) and an associated array of data labels, called its index.

In [6]:
series_obj = pd.Series([4, 7, -5, 3])
series_obj

0    4
1    7
2   -5
3    3
dtype: int64

In [7]:
series_obj.values

array([ 4,  7, -5,  3])

In [15]:
series_obj.index = ["aval", "dovom", "sevom", "charom"]

In [17]:
series_obj["dovom"]

7

In [19]:
series_obj[series_obj > 3]

aval     4
dovom    7
dtype: int64

In [20]:
np.exp(series_obj)

aval        54.598150
dovom     1096.633158
sevom        0.006738
charom      20.085537
dtype: float64

In [22]:
"aval" in series_obj

True

In [29]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000, 'Tehran': None}
indx = ["C", 'Ohio', 'Texas']
states = pd.Series(sdata, index=indx)
states

C            NaN
Ohio     35000.0
Texas    71000.0
dtype: float64

In [30]:
new_states = pd.Series(sdata)
new_states

Ohio      35000.0
Texas     71000.0
Oregon    16000.0
Utah       5000.0
Tehran        NaN
dtype: float64

In [31]:
states + new_states

C              NaN
Ohio       70000.0
Oregon         NaN
Tehran         NaN
Texas     142000.0
Utah           NaN
dtype: float64

In [28]:
states[states.isnull()]  = 2000
states

C         2000.0
Ohio     35000.0
Texas    71000.0
dtype: float64

### DataFrame

In [38]:
data = {
    'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
    'year': [2000, 2001, 2002, 2001, 2002, 2003],
    'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
}

In [59]:
df = pd.DataFrame(data, columns=['year', 'state', 'pop'])

In [63]:
df.rename(columns={'year': 'sali'}, inplace=True)

In [64]:
df.head()

   sali   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [65]:
df.describe()

              sali       pop
count     6.000000  6.000000
mean   2001.500000  2.550000
std       1.048809  0.836062
min    2000.000000  1.500000
25%    2001.000000  1.875000
50%    2001.500000  2.650000
75%    2002.000000  3.125000
max    2003.000000  3.600000

In [66]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   sali    6 non-null      int64
 1   state   6 non-null      object
 2   pop     6 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 272.0+ bytes

In [68]:
type(df['sali'])

pandas.core.series.Series

In [69]:
df.sali

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: sali, dtype: int64

In [70]:
iris_df = pd.read_csv('iris.csv')

In [71]:
iris_df.head()

   sepal_length  sepal_width  petal_length  petal_width   class
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [72]:
iris_df.shape

(150, 5)

In [73]:
set(iris_df['class'])

{'setosa', 'versicolor', 'virginica'}

In [77]:
iris_df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.054000      3.758667     1.198667
std        0.828066     0.433594      1.764420     0.763161
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000